; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 11500)
	(= (fuel plane1) 1965)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at person1 city2)
	(at person2 city3)
	(at person3 city0)
	(at person4 city4)
	(at person5 city6)
	(at person6 city4)
	(at person7 city2)
	(at person8 city4)
	(at person9 city6)
	(at person10 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 568)
	(= (distance city0 city2) 564)
	(= (distance city0 city3) 782)
	(= (distance city0 city4) 919)
	(= (distance city0 city5) 576)
	(= (distance city0 city6) 542)
	(= (distance city1 city0) 568)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 660)
	(= (distance city1 city3) 750)
	(= (distance city1 city4) 880)
	(= (distance city1 city5) 820)
	(= (distance city1 city6) 824)
	(= (distance city2 city0) 564)
	(= (distance city2 city1) 660)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 635)
	(= (distance city2 city4) 873)
	(= (distance city2 city5) 614)
	(= (distance city2 city6) 665)
	(= (distance city3 city0) 782)
	(= (distance city3 city1) 750)
	(= (distance city3 city2) 635)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 747)
	(= (distance city3 city5) 848)
	(= (distance city3 city6) 862)
	(= (distance city4 city0) 919)
	(= (distance city4 city1) 880)
	(= (distance city4 city2) 873)
	(= (distance city4 city3) 747)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 769)
	(= (distance city4 city6) 872)
	(= (distance city5 city0) 576)
	(= (distance city5 city1) 820)
	(= (distance city5 city2) 614)
	(= (distance city5 city3) 848)
	(= (distance city5 city4) 769)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 851)
	(= (distance city6 city0) 542)
	(= (distance city6 city1) 824)
	(= (distance city6 city2) 665)
	(= (distance city6 city3) 862)
	(= (distance city6 city4) 872)
	(= (distance city6 city5) 851)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city6)
	(at person2 city6)
	(at person3 city5)
	(at person4 city0)
	(at person5 city2)
	(at person6 city0)
	(at person7 city5)
	(at person8 city5)
	(at person9 city6)
	(at person10 city1)
	))

(:metric minimize (+ (* 4 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person6 plane1 city4)
   deleted: (at person6 city4)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 10
2. (board person8 plane1 city4)
   deleted: (at person8 city4)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 10
3. (board person4 plane1 city4)
   deleted: (at person4 city4)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 1 of 10
4. (refuel plane1 city4)
   changed: (fuel plane1) from 1965 to 11500
   goals met: 1 of 10
5. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 4365, (fuel plane1) from 11500 to 7135
   goals met: 1 of 10
6. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 1 of 10
7. (board person1 plane1 city2)
   deleted: (at person1 city2)
   added: (in person1 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 1 of 10
8. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4365 to 7185, (fuel plane1) from 7135 to 4315
   goals met: 1 of 10
9. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   changed: (onboard plane1) from 5 to 4
   goals met: 2 of 10
10. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 4 to 3
   goals met: 3 of 10
11. (board person10 plane1 city0)
   deleted: (at person10 city0)
   added: (in person10 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 3 of 10
12. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 3 of 10
13. (fly plane1 city0 city5)
   deleted: (at plane1 city0)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 7185 to 10065, (fuel plane1) from 4315 to 1435
   goals met: 3 of 10
14. (debark person7 plane1 city5)
   deleted: (in person7 plane1)
   added: (at person7 city5)
   changed: (onboard plane1) from 5 to 4
   goals met: 4 of 10
15. (debark person8 plane1 city5)
   deleted: (in person8 plane1)
   added: (at person8 city5)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 10
16. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 10
17. (refuel plane1 city5)
   changed: (fuel plane1) from 1435 to 11500
   goals met: 6 of 10
18. (fly plane1 city5 city1)
   deleted: (at plane1 city5)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 10065 to 14165, (fuel plane1) from 11500 to 7400
   goals met: 6 of 10
19. (debark person10 plane1 city1)
   deleted: (in person10 plane1)
   added: (at person10 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 10
20. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 14165 to 17915, (fuel plane1) from 7400 to 3650
   goals met: 7 of 10
21. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 10
22. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 17915 to 21090, (fuel plane1) from 3650 to 475
   goals met: 7 of 10
23. (refuel plane1 city2)
   changed: (fuel plane1) from 475 to 11500
   goals met: 7 of 10
24. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 21090 to 24415, (fuel plane1) from 11500 to 8175
   goals met: 7 of 10
25. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 10
26. (debark person2 plane1 city6)
   deleted: (in person2 plane1)
   added: (at person2 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 10
27. (board person5 plane1 city6)
   deleted: (at person5 city6)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 9 of 10
28. (zoom plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 24415 to 31730, (fuel plane1) from 8175 to 860
   goals met: 9 of 10
29. (debark person5 plane1 city2)
   deleted: (in person5 plane1)
   added: (at person5 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 10
